tutorials/surfaceTracking/interTrackFoam/hydrofoil/constant/faMesh/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}


// ************************************************************************** //

polyMeshPatches  1( freeSurface );

boundary
{
    inlet
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  inlet;
    }

    outlet
    {
        type                patch;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  outlet;
    }

    frontAndBack
    {
        type                empty;
        ownerPolyPatch      freeSurface;
        neighbourPolyPatch  frontAndBackPlanes;
    }
}

// ************************************************************************** //
